dangn_example = '''
[예시 1]

가게 이름: 코지 버거
가게 주소: 서울특별시 강남구 강남대로 1234
홍보 주제: 추운 날씨에 고객 감사의 마음을 담은 무료 머쉬룸 스프 제공
홍보 채널: 매장 내 공지 및 소셜 미디어
홍보 대상: 매장을 방문하는 모든 고객
강조할 내용: 따뜻한 스프와 함께하는 포근한 분위기

답변:

🍲 코지 버거에서 따뜻한 감사의 마음을 전합니다! 🍲

추운 날씨에 매장을 찾아주시는 모든 고객님들께 감사의 인사를 전하고자, 매장 내 햄버거 주문 시 무료로 머쉬룸 스프를 제공해 드립니다.

매일 직접 조리한 따끈한 스프로 여러분을 따뜻하게 만들어드리겠습니다. 언제든 편히 방문해주세요 🙂

테이크아웃은 불가하며, 테이블당 1개의 머쉬룸 스프가 제공됩니다.
우리의 감사한 마음과 함께, 코지 버거에서 포근한 분위기를 느껴보세요!

[예시 2]

📍 코지 버거
📍 서울특별시 강남구 강남대로 1234


가게 이름: 옥수역 캘프
가게 주소: 서울시 성동구 옥수로 123
홍보 주제: 5월 어버이날/어린이날 기념 쿠폰 이벤트
홍보 채널: 매장 내 공지 및 소셜 미디어
홍보 대상: 매장 이용 고객 및 주변 지역 주민
강조할 내용: 가정의 달을 기념하여 특별 쿠폰 제공

답변:

🎉 5월 어버이날/어린이날 기념 쿠폰 이벤트 안내 🎉

안녕하세요, 옥수역 캘프입니다! 다가오는 5월 가정의 달을 맞이하여, 내일부터 5월 1일까지 매장 이용 또는 포장 시, 주문 가능한 프라이즈 메뉴 1종 쿠폰을 드립니다!

본 쿠폰을 매장에서 보여주시면, 특별한 혜택을 누리실 수 있습니다. 어버이님과 함께하는 소중한 날, 옥수역 캘프에서 함께해주세요 😇

📍 옥수역 캘프
📍 서울시 성동구 옥수로 123

[예시 3]

가게 이름: 건대술집 셰프노리
가게 주소: 서울 광진구 군자로 5 1층 & 지하 1층
홍보 주제: 관동식 스키야키, 얼큰토마토전골, 나가사키 우삼겹 전골, 모둠감자튀김
홍보 채널: 당근마켓
홍보 대상: 20대 남성, 20대 여성
강조할 내용: 분위기, 정성, 신메뉴
답변:
안녕하세요! 요리가 맛있고, 분위기 좋은 건대술집 셰프노리 입니다!
봄과 여름을 맞아 새롭게 메뉴를 리뉴얼 하였습니다!

셰프가 직접 끓이는 정성 가득, 가쓰오향도 가득한 관동식 스키야키!
깔끔하고 얼큰한 국물이 일품! 몸에도 좋고 맛도 좋은 얼큰토마토전골!
우삼겹살 가득 담긴 깊고 담백한 나가사키 우삼겹 전골!
직접 종류별로 먹어 보고 맛있는 것만 골라 담은 모둠감자튀김!

심혈을 기울여 준비한 셰프노리의 새로운 메뉴들 맛보러 놀러오세요~!!!

📍 건대술집 셰프노리
📌 서울 광진구 군자로 5 1층 & 지하 1층
'''

instagram_example = '''
[예시 1]

가게 이름: 마라탕 숙명여대점
가게 주소: 서울특별시 용산구
홍보 주제: 꿔바로우
홍보 채널: 인스타그램
홍보 대상: 20대 남성, 20대 여성
강조할 내용: 바삭함
답변:

🔥🍲 마라탕 숙명여대점, 인스타에서 뜨거운 신제품 소식! 🔥🍲

서울 용산구의 맛있는 마라탕으로 유명한 저희 가게가 더욱 뜨거워지고 있어요! 이번에는 특별한 메뉴 소식을 전해드리려고 해요. 바로 "꿔바로우"를 소개합니다! 🥟🔥

마라탕의 진가를 그대로 느낄 수 있는 이 꿔바로우는 바삭한 식감이 일품이에요. 한 입 베어먹으면 바로 입안 가득 퍼지는 고소함과 함께 마라의 진한 맛이 가득 느껴져요. 또한, 특별한 조리법으로 더욱 고소하고 바삭한 맛을 느낄 수 있답니다.

인스타그램에서만 만나볼 수 있는 단 하나의 맛, 꿔바로우를 맛보시고 싶으신 분들은 지금 저희 마라탕 숙명여대점을 방문해주세요! 여러분의 입맛을 자극할 특별한 맛을 선사할게요. 함께 맛있는 순간을 만들어보세요! 🔥🥢✨

📍 마라탕 숙명여대점
📌 서울특별시 용산구

#마라탕숙명여대점 #꿔바로우 #뜨거운맛 #마라소스 #맛있는마라특제어 #바삭바삭 #매콤달콤 #20대맛집 #인스타푸드

[예시 2]

가게 이름: 샤브댁  
가게 주소: 서울 광진구 동일로28길 32 1층  
홍보 주제: 건강하고 푸짐한 샤브샤브  
홍보 채널: 인스타그램  
홍보 대상: 40대 남성, 50대 남성, 40대 여성, 50대 여성,
강조할 내용: 건강한 식사와 편안한 분위기, 샤브샤브 6,000원, 9,800원 안주류 주문 시 생맥 한잔이 무료

답변:

🏷 건강한 몸을 위한 푸짐한 샤브샤브 경험을 소개합니다! ✨

건대 #샤브댁에서 여유로운 식사를 즐겨보세요. 샤브샤브를 6,000원대로 맛볼 수 있는 곳이에요!

🍲 매일 직접 만든 뜨끈한 육수와 소스로 신선한 야채&고기를 듬뿍 즐겨보세요. 건강한 한 끼 식사로 몸과 마음을 기를 수 있어요 🤤

🍜 기본/얼큰/스키야키 3가지 맛의 육수로 다채로운 맛을 경험하세요. 김치우동전골이 유명한 술집보다 더 맛있다는 소문이죠!

🍻 9,800원 안주류 주문 시 생맥 한잔이 무료하니, 편안한 분위기에서 식사를 즐기실 수 있어요. 오랜 친구들과의 모임에도 안성맞춤이죠 😮

👥 혼자서도 즐길 수 있고, 가족과 함께 식사를 즐기기에도 딱 좋은 곳입니다. 건대 #샤브댁으로 여유로운 시간을 보내보세요!

📍 샤브댁
📍 서울 광진구 동일로28길 32 1층

#건대맛집 #건대샤브샤브 #건대맛집추천 #건대입구맛집 #어린이대공원맛집 #성수샤브샤브 #샤브댁
'''

kakaotalk = '''
[예시 1]

가게 이름: 오징어빵 광장시장점
가게 주소: 서울특별시 종로구 종로4가 165-33
홍보 주제: 오징어빵
홍보 채널: 카카오톡 채널
홍보 대상: 20대 남성, 20대 여성
강조할 내용: 다양한 맛
답변:

광장시장 내 오징어빵!
쌀로 만든 빵에 진짜 오징어가 들어 있어 아주 맛있습니다.
다수 방송에 소개되었으며, 치즈맛/야채맛/팥맛으로 구성되어 있습니다.
선물용도 따로 준비되어 있으니 놀러 오세요!

아래 링크로 배달 주문도 가능합니다.
오시는 길:: 광장시장 내

[예시 2]

가게 이름: 서준이네 반찬가게
가게 주소: 경기도 성남시 분당구 황새울로 57
홍보 주제: 돼지고기 버섯찌개
홍보 채널: 카카오톡 채널
홍보 대상: 50대 남성, 여성
강조할 내용: 진한 국물
답변:

서준이가 알려주는 오늘의 레시피!
저희 가게의 인기 메뉴 <돼지고기 버섯찌개> 입니다.
육수부터 신선한 재료까지 한 번에 끓여요! 마지막으로 칼국수와 죽까지!
오늘 저녁, 돼지고기 버섯찌개 어떠세요?

가게 오시는 길
- 수내역 5번출구

[예시 3]

가게 이름: 찬호 떡집
가게 주소: 부산광역시 영도구 남항로 41
홍보 주제: 녹차 호두 팥찰떡
홍보 채널: 카카오톡 채널
홍보 대상: 40대 여성, 50대 여성
강조할 내용: 진한 녹차맛, 리뷰 이벤트, 대량 구매시 추가 할인
답변:

부산의 맛있는 찬호 떡집, 녹차 호두 팥찰떡으로 여러분을 초대합니다!
진한 녹차 향과 신선한 호두, 달콤한 팥이 어우러진 저희의 특별한 떡을 맛보세요.
리뷰 이벤트로 특별한 혜택을 누리고, 대량 구매시 추가 할인 혜택도 놓치지 마세요.
부산광역시 영도구 남항로 41에 위치한 찬호 떡집에서 여러분을 기다립니다.

카카오톡 채널에서도 만나보실 수 있습니다.
40대와 50대 여성분들의 입맛을 사로잡는 찬호 떡집에서 특별한 떡 경험을 즐겨보세요!"
'''
